Repository: 84000/data-translation-memory
Catalog: toh521-v4.tmx
Source language: bo
Languages: en

source: འཕགས་པ་རྟེན་ཅིང་འབྲེལ་པར་འབྱུང་བའི་སྙིང་པོ་ཞེས་བྱ་བ།
en: The Noble Essence of Dependent Arising

source: སངས་རྒྱས་བཅོམ་ལྡན་འདས་ལ་ཕྱག་འཚལ་ལོ། །
en: Homage to the blessed Buddha!

source: ཆོས་གང་རྒྱུས་འབྱུང་དེ་དག་གི། །རྒྱུ་དང་དེ་འགོག་གང་ཡིན་པ། །དེ་བཞིན་གཤེགས་པས་བཀའ་སྩལ་ཏེ། །
en: “The Tathāgata explained the cause Of dharmas that arise from causes, And he taught their cessation.

source: དགེ་སྦྱོང་ཆེན་པོ་འདི་སྐད་གསུངས། །
en: Thus the Great Śramaṇa has instructed.

source: ཡེ་དྷརྨཱ་ཧེ་ཏུ་པྲ་བྷ་བཱ་ཧེ་ཏུན་ཏེ་ཥཱནྟ་ཐཱ་ག་ཏོ་ཧྱ་བ་དཏ། ཏེ་ཥཱཉྩ་ཡོ་ནི་རོ་དྷ་ཨེ་བཾ་བཱ་དཱི་མ་ཧཱ་ཤྲ་མ་ཎཿ།
en: ye dharmā hetuprabhavā hetuṃ teṣāṃ tathāgato hy avadat | teṣāṃ ca yo nirodha evaṃvādī mahāśramaṇaḥ ||

source: སྙིང་པོ་འདི་ལན་གཅིག་བརྗོད་པས་སྡིག་པ་ཐམས་ཅད་བྱང་བར་འགྱུར་རོ། །མི་མཐུན་པའི་ཕྱོགས་ཐམས་ཅད་ཞི་ཞིང་བཟློག་པར་འགྱུར་རོ། །
en: By reciting this essence once, all negative actions will be purified and all adverse conditions will be pacified and averted.

source: དངོས་པོ་གང་ལ་དམིགས་ཏེ་བརྗོད་ན་སངས་རྒྱས་ཀྱི་སྐུའམ། མཆོད་རྟེན་དུ་བྱས་པར་འགྱུར་མཆོད་པ་གང་ལ་དམིགས་ཏེ། བརྗོད་ན་འཇིག་རྟེན་གྱི་ཁམས་གང་བཅོམ་ཕུལ་བར་འགྱུར་རོ། །
en: Any object that one envisions while reciting it will become the body of the Buddha or a stūpa, and any offering one envisions while reciting it will be offered as if they fill an entire world realm.

source: རྟེན་ཅིང་འབྲེལ་པར་འབྱུང་བའི་སྙིང་པོ་རྫོགས་སོ།​།
en: The Essence of Dependent Arising is complete.
